NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_generic_level_client.c
    TEST_ASSERT_TRUE(handler_found);
}

static void helper_expect_for_model_init_success(void)
{
    access_model_add_StubWithCallback(access_model_add_mock);
    access_model_subscription_list_alloc_ExpectAnyArgsAndReturn(NRF_SUCCESS);
}

static void helper_init_model_context_and_expectations(void)
{
    m_client_cbs.level_status_cb = level_client_status_cb;
    m_client_cbs.ack_transaction_status_cb = level_client_ack_transaction_cb;
    m_client_cbs.periodic_publish_cb = level_client_publish_timeout_cb;
    m_client.settings.p_callbacks = &m_client_cbs;
    m_client.settings.force_segmented = false;
    m_client.settings.transmic_size = NRF_MESH_TRANSMIC_SIZE_SMALL;
    m_client.settings.timeout = TEST_MODEL_TIMEOUT;
    helper_expect_for_model_init_success();
}

/******** Model Callbacks ********/
static void level_client_status_cb(const generic_level_client_t * p_self,
                                   const access_message_rx_meta_t * p_meta,
                                   const generic_level_status_params_t * p_in)
{
    printf("level_client_status_cb\n");
    TEST_ASSERT_NOT_NULL(p_meta);

    TEST_ASSERT_EQUAL(m_expected_status.present_level, p_in->present_level);
    TEST_ASSERT_EQUAL(m_expected_status.target_level, p_in->target_level);
    TEST_ASSERT_EQUAL(m_expected_status.remaining_time_ms, p_in->remaining_time_ms);
}

/* Dummy: unsued */
static void level_client_ack_transaction_cb(access_model_handle_t model_handle, void * p_args,
                                            access_reliable_status_t status)
{
    return;
}

/* Dummy: unsued */
static void level_client_publish_timeout_cb(access_model_handle_t handle, void * p_args)
{
    return;
}


/******** Setup and Tear Down ********/
void setUp(void)
{
    access_mock_Init();
    access_config_mock_Init();
    access_reliable_mock_Init();
    nrf_mesh_mock_Init();
    timer_mock_Init();
}

void tearDown(void)
{
    access_mock_Verify();
    access_mock_Destroy();
    access_config_mock_Verify();
    access_config_mock_Destroy();
    access_reliable_mock_Verify();
    access_reliable_mock_Destroy();
    nrf_mesh_mock_Verify();
    nrf_mesh_mock_Destroy();
    timer_mock_Verify();
    timer_mock_Destroy();
    timer_scheduler_mock_Verify();
    timer_scheduler_mock_Destroy();
}
/******** Tests ********/
void test_generic_level_client_init(void)
{
    /* Null checks */
    memset(&m_client, 0, sizeof(generic_level_client_t));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_init(NULL, TEST_ELEMENT_INDEX));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));
    m_client.settings.p_callbacks = &m_client_cbs;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));
    m_client_cbs.ack_transaction_status_cb = level_client_ack_transaction_cb;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));
    m_client_cbs.periodic_publish_cb = level_client_publish_timeout_cb;
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));
    m_client_cbs.level_status_cb = level_client_status_cb;

    /* All mandatory API inputs are correct */
    helper_expect_for_model_init_success();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));
}


void test_generic_level_client_set(void)
{
    generic_level_set_params_t set_params = {0};
    model_transition_t transition_params = {0};
    generic_level_set_msg_pkt_t pkt;
    uint16_t opcode;
    uint16_t len;

    helper_init_model_context_and_expectations();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));

    /* case: NULL checks */
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_set(NULL, &set_params, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_set(&m_client, NULL, NULL));

    /* case: Busy check fails */
    access_reliable_model_is_free_ExpectAndReturn(m_client.model_handle, false);
    TEST_ASSERT_EQUAL(NRF_ERROR_BUSY, generic_level_client_set(&m_client, &set_params, &transition_params));

    /* case: Invalid transition time */
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_set(&m_client, &set_params, &transition_params));
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS;
    transition_params.delay_ms = DELAY_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_set(&m_client, &set_params, &transition_params));

    /* case: Message including optional params */
    set_params.level = 1;
    set_params.tid = 0;
    transition_params.transition_time_ms = 1000;
    transition_params.delay_ms = 0;

    pkt.level = set_params.level;
    pkt.tid = set_params.tid;
    pkt.transition_time = model_transition_time_encode(transition_params.transition_time_ms);
    pkt.delay = model_delay_encode(transition_params.delay_ms);

    opcode = GENERIC_LEVEL_OPCODE_SET;
    len = GENERIC_LEVEL_SET_MAXLEN;
    EXPECT_ACCESS_MESSAGE_RELIABLE_PUBLISH(m_client.model_handle, opcode, &pkt, len);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_set(&m_client, &set_params, &transition_params));

    /* case: Message excluding optional params */
    len = GENERIC_LEVEL_SET_MINLEN;
    EXPECT_ACCESS_MESSAGE_RELIABLE_PUBLISH(m_client.model_handle, opcode, &pkt, len);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_set(&m_client, &set_params, NULL));
}

void test_generic_level_client_set_unack(void)
{
    generic_level_set_params_t set_params = {0};
    model_transition_t transition_params = {0};
    generic_level_set_msg_pkt_t pkt;
    uint16_t opcode;
    uint16_t len;

    helper_init_model_context_and_expectations();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));

    /* case: NULL checks */
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_set_unack(NULL, &set_params, NULL, TEST_MODEL_UNACK_REPEATS));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_set_unack(&m_client, NULL, NULL, TEST_MODEL_UNACK_REPEATS));

