NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_generic_level_client.c
    /* case: Invalid transition time */
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_set_unack(&m_client, &set_params, &transition_params, TEST_MODEL_UNACK_REPEATS));
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS;
    transition_params.delay_ms = DELAY_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_set_unack(&m_client, &set_params, &transition_params, TEST_MODEL_UNACK_REPEATS));

    /* case: Message including optional params */
    set_params.level = 1;
    set_params.tid = 0;
    transition_params.transition_time_ms = 1000;
    transition_params.delay_ms = 0;

    pkt.level = set_params.level;
    pkt.tid = set_params.tid;
    pkt.transition_time = model_transition_time_encode(transition_params.transition_time_ms);
    pkt.delay = model_delay_encode(transition_params.delay_ms);

    opcode = GENERIC_LEVEL_OPCODE_SET_UNACKNOWLEDGED;
    len = GENERIC_LEVEL_SET_MAXLEN;
    EXPECT_ACCESS_MESSAGE_PUBLISH(m_client.model_handle, opcode, &pkt, len, TEST_MODEL_UNACK_REPEATS);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_set_unack(&m_client, &set_params, &transition_params, TEST_MODEL_UNACK_REPEATS));

    /* case: Message excluding optional params */
    len = GENERIC_LEVEL_SET_MINLEN;
    EXPECT_ACCESS_MESSAGE_PUBLISH(m_client.model_handle, opcode, &pkt, len, TEST_MODEL_UNACK_REPEATS);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_set_unack(&m_client, &set_params, NULL, TEST_MODEL_UNACK_REPEATS));
}

void test_generic_level_client_delta_set(void)
{
    generic_level_delta_set_params_t set_params = {0};
    model_transition_t transition_params = {0};
    generic_level_delta_set_msg_pkt_t pkt;
    uint16_t opcode;
    uint16_t len;

    helper_init_model_context_and_expectations();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));

    /* case: NULL checks */
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_delta_set(NULL, &set_params, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_delta_set(&m_client, NULL, NULL));

    /* case: Busy check fails */
    access_reliable_model_is_free_ExpectAndReturn(m_client.model_handle, false);
    TEST_ASSERT_EQUAL(NRF_ERROR_BUSY, generic_level_client_delta_set(&m_client, &set_params, &transition_params));

    /* case: Invalid transition time */
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_delta_set(&m_client, &set_params, &transition_params));
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS;
    transition_params.delay_ms = DELAY_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_delta_set(&m_client, &set_params, &transition_params));

    /* case: Message including optional params */
    set_params.delta_level = 0xAAAAAAAA;
    set_params.tid = 0;
    transition_params.transition_time_ms = 1000;
    transition_params.delay_ms = 0;

    pkt.delta_level = set_params.delta_level;
    pkt.tid = set_params.tid;
    pkt.transition_time = model_transition_time_encode(transition_params.transition_time_ms);
    pkt.delay = model_delay_encode(transition_params.delay_ms);

    opcode = GENERIC_LEVEL_OPCODE_DELTA_SET;
    len = GENERIC_LEVEL_DELTA_SET_MAXLEN;
    EXPECT_ACCESS_MESSAGE_RELIABLE_PUBLISH(m_client.model_handle, opcode, &pkt, len);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_delta_set(&m_client, &set_params, &transition_params));

    /* case: Message excluding optional params */
    len = GENERIC_LEVEL_DELTA_SET_MINLEN;
    EXPECT_ACCESS_MESSAGE_RELIABLE_PUBLISH(m_client.model_handle, opcode, &pkt, len);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_delta_set(&m_client, &set_params, NULL));
}

void test_generic_level_client_delta_set_unack(void)
{
    generic_level_delta_set_params_t set_params = {0};
    model_transition_t transition_params = {0};
    generic_level_delta_set_msg_pkt_t pkt;
    uint16_t opcode;
    uint16_t len;

    helper_init_model_context_and_expectations();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));

    /* case: NULL checks */
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_delta_set_unack(NULL, &set_params, NULL, TEST_MODEL_UNACK_REPEATS));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_delta_set_unack(&m_client, NULL, NULL, TEST_MODEL_UNACK_REPEATS));

    /* case: Invalid transition time */
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_delta_set_unack(&m_client, &set_params, &transition_params, TEST_MODEL_UNACK_REPEATS));
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS;
    transition_params.delay_ms = DELAY_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_delta_set_unack(&m_client, &set_params, &transition_params, TEST_MODEL_UNACK_REPEATS));

    /* case: Message including optional params */
    set_params.delta_level = 0xAAAAAAAA;
    set_params.tid = 0;
    transition_params.transition_time_ms = 1000;
    transition_params.delay_ms = 0;

    pkt.delta_level = set_params.delta_level;
    pkt.tid = set_params.tid;
    pkt.transition_time = model_transition_time_encode(transition_params.transition_time_ms);
    pkt.delay = model_delay_encode(transition_params.delay_ms);

    opcode = GENERIC_LEVEL_OPCODE_DELTA_SET_UNACKNOWLEDGED;
    len = GENERIC_LEVEL_DELTA_SET_MAXLEN;
    EXPECT_ACCESS_MESSAGE_PUBLISH(m_client.model_handle, opcode, &pkt, len, TEST_MODEL_UNACK_REPEATS);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_delta_set_unack(&m_client, &set_params, &transition_params, TEST_MODEL_UNACK_REPEATS));

    /* case: Message excluding optional params */
    len = GENERIC_LEVEL_DELTA_SET_MINLEN;
    EXPECT_ACCESS_MESSAGE_PUBLISH(m_client.model_handle, opcode, &pkt, len, TEST_MODEL_UNACK_REPEATS);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_delta_set_unack(&m_client, &set_params, NULL, TEST_MODEL_UNACK_REPEATS));
}

void test_generic_level_client_move_set(void)
{
    generic_level_move_set_params_t set_params = {0};
    model_transition_t transition_params = {0};
    generic_level_move_set_msg_pkt_t pkt;
    uint16_t opcode;
    uint16_t len;

    helper_init_model_context_and_expectations();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));

    /* case: NULL checks */
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_move_set(NULL, &set_params, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_move_set(&m_client, NULL, NULL));

    /* case: Busy check fails */
    access_reliable_model_is_free_ExpectAndReturn(m_client.model_handle, false);
    TEST_ASSERT_EQUAL(NRF_ERROR_BUSY, generic_level_client_move_set(&m_client, &set_params, &transition_params));

