NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_generic_level_client.c
    /* case: Invalid transition time */
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_move_set(&m_client, &set_params, &transition_params));
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS;
    transition_params.delay_ms = DELAY_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_move_set(&m_client, &set_params, &transition_params));

    /* case: Message including optional params */
    set_params.move_level = 0xAAAA;
    set_params.tid = 0;
    transition_params.transition_time_ms = 1000;
    transition_params.delay_ms = 0;

    pkt.move_level = set_params.move_level;
    pkt.tid = set_params.tid;
    pkt.transition_time = model_transition_time_encode(transition_params.transition_time_ms);
    pkt.delay = model_delay_encode(transition_params.delay_ms);

    opcode = GENERIC_LEVEL_OPCODE_MOVE_SET;
    len = GENERIC_LEVEL_MOVE_SET_MAXLEN;
    EXPECT_ACCESS_MESSAGE_RELIABLE_PUBLISH(m_client.model_handle, opcode, &pkt, len);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_move_set(&m_client, &set_params, &transition_params));

    /* case: Message excluding optional params */
    len = GENERIC_LEVEL_MOVE_SET_MINLEN;
    EXPECT_ACCESS_MESSAGE_RELIABLE_PUBLISH(m_client.model_handle, opcode, &pkt, len);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_move_set(&m_client, &set_params, NULL));
}

void test_generic_level_client_move_set_unack(void)
{
    generic_level_move_set_params_t set_params = {0};
    model_transition_t transition_params = {0};
    generic_level_move_set_msg_pkt_t pkt;
    uint16_t opcode;
    uint16_t len;

    helper_init_model_context_and_expectations();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));

    /* case: NULL checks */
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_move_set_unack(NULL, &set_params, NULL, TEST_MODEL_UNACK_REPEATS));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_move_set_unack(&m_client, NULL, NULL, TEST_MODEL_UNACK_REPEATS));

    /* case: Invalid transition time */
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_move_set_unack(&m_client, &set_params, &transition_params, TEST_MODEL_UNACK_REPEATS));
    transition_params.transition_time_ms = TRANSITION_TIME_MAX_MS;
    transition_params.delay_ms = DELAY_TIME_MAX_MS + 1;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_PARAM, generic_level_client_move_set_unack(&m_client, &set_params, &transition_params, TEST_MODEL_UNACK_REPEATS));

    /* case: Message including optional params */
    set_params.move_level = 0xAAAA;
    set_params.tid = 0;
    transition_params.transition_time_ms = 1000;
    transition_params.delay_ms = 0;

    pkt.move_level = set_params.move_level;
    pkt.tid = set_params.tid;
    pkt.transition_time = model_transition_time_encode(transition_params.transition_time_ms);
    pkt.delay = model_delay_encode(transition_params.delay_ms);

    opcode = GENERIC_LEVEL_OPCODE_MOVE_SET_UNACKNOWLEDGED;
    len = GENERIC_LEVEL_MOVE_SET_MAXLEN;
    EXPECT_ACCESS_MESSAGE_PUBLISH(m_client.model_handle, opcode, &pkt, len, TEST_MODEL_UNACK_REPEATS);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_move_set_unack(&m_client, &set_params, &transition_params, TEST_MODEL_UNACK_REPEATS));

    /* case: Message excluding optional params */
    len = GENERIC_LEVEL_MOVE_SET_MINLEN;
    EXPECT_ACCESS_MESSAGE_PUBLISH(m_client.model_handle, opcode, &pkt, len, TEST_MODEL_UNACK_REPEATS);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_move_set_unack(&m_client, &set_params, NULL, TEST_MODEL_UNACK_REPEATS));
}

void test_generic_level_client_get(void)
{
    uint16_t opcode;
    uint16_t len;

    helper_init_model_context_and_expectations();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));

    /* case: NULL checks */
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, generic_level_client_get(NULL));

    /* case: Message does not have any params */
    opcode = GENERIC_LEVEL_OPCODE_GET;
    len = 0;
    EXPECT_ACCESS_MESSAGE_RELIABLE_PUBLISH(m_client.model_handle, opcode, NULL, len);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_get(&m_client));
}

void test_status_handle(void)
{
    access_message_rx_t request_msg;
    generic_level_status_msg_pkt_t pkt;
    uint16_t opcode;
    uint16_t len;

    helper_init_model_context_and_expectations();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, generic_level_client_init(&m_client, TEST_ELEMENT_INDEX));

    opcode = GENERIC_LEVEL_OPCODE_STATUS;

    /* case: Optional params not included */
    pkt.present_level = 1;
    len = GENERIC_LEVEL_STATUS_MINLEN;

    m_expected_status.present_level = pkt.present_level;
    m_expected_status.target_level = pkt.present_level;
    m_expected_status.remaining_time_ms = 0;
    ACCESS_MESSAGE_RX(request_msg, pkt, opcode, len);
    helper_call_opcode_handler(m_client.model_handle, &request_msg, &m_client);

    /* case: Optional params included */
    pkt.present_level = 0;
    pkt.target_level = 1;
    pkt.remaining_time = model_transition_time_encode(1000);
    len = GENERIC_LEVEL_STATUS_MAXLEN;

    m_expected_status.present_level = pkt.present_level;
    m_expected_status.target_level = pkt.target_level;
    m_expected_status.remaining_time_ms = 1000;
    ACCESS_MESSAGE_RX(request_msg, pkt, opcode, len);
    helper_call_opcode_handler(m_client.model_handle, &request_msg, &m_client);

    /* case: Message with invalid length was received, this should not trigger any TEST() */
    m_expected_status.present_level = 0xCAFE;
    m_expected_status.target_level = 0xCAFE;
    m_expected_status.remaining_time_ms = 0xCAFE;
    len = GENERIC_LEVEL_STATUS_MAXLEN + 1;
    ACCESS_MESSAGE_RX(request_msg, pkt, opcode, len);
    helper_call_opcode_handler(m_client.model_handle, &request_msg, &m_client);
}
